[
  {
    "id": 1,
    "image": "https://logodownload.org/wp-content/uploads/2015/04/whatsapp-1.png",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "description": "WhatsApp Messenger is one of the most popular communication platforms in the world, allowing users to stay connected instantly and securely. It supports text messaging, voice messages, video and voice calls, and media sharing such as photos, videos, documents, and contacts. With end-to-end encryption, it ensures your privacy and safety while chatting. Users can also create groups for family, work, or communities and share updates in real time. WhatsApp Web lets you use the app on your computer easily. You can back up your chats to Google Drive, customize notifications, and manage privacy settings efficiently. The app also supports dark mode, quick replies, and broadcast messages. Whether personal or professional, WhatsApp provides a smooth, fast, and reliable communication experience for everyone.",
    "size": 57,
    "reviews": 420,
    "ratingAvg": 4.4,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 3700 }
    ]
  },
  {
    "id": 2,
    "image": "https://pin.it/4kcezpws6",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "description": "Instagram is a visual-first social media platform designed for creativity, connection, and self-expression. Users can share photos, videos, and Stories that disappear after 24 hours, as well as create Reels to showcase short, entertaining clips. It allows for live streaming, messaging, and exploring trending topics from all around the world. With built-in filters and editing tools, users can enhance their content before sharing it publicly or privately. The Explore page helps you discover new creators and trends that match your interests. Businesses and influencers use Instagram for marketing, engagement, and building communities. It also supports shopping features and ad campaigns for brands. Whether you’re connecting with friends, exploring art, or growing your brand, Instagram brings visual storytelling to life.",
    "size": 34,
    "reviews": 30,
    "ratingAvg": 4.3,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 6000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 2150 }
    ]
  },
  {
    "id": 3,
    "image": "https://apksbio.com/spotify-lite-mod-apk/",
    "title": "Spotify: Music and Podcasts",
    "companyName": "Spotify Ltd.",
    "description": "Spotify is a leading audio streaming platform that offers millions of songs, albums, and podcasts from artists all over the world. It lets you create custom playlists, follow your favorite artists, and discover new releases daily. The app uses intelligent recommendations to personalize your music experience. You can listen offline, switch between devices seamlessly, and enjoy curated playlists based on your mood or activity. Spotify’s podcast collection covers every genre, from news to storytelling. Premium subscribers get ad-free playback and higher audio quality. You can also share playlists with friends, use collaborative playlists, and connect your account to smart devices. Spotify brings together a massive community of music lovers who celebrate creativity and sound.",
    "size": 25,
    "reviews": 28,
    "ratingAvg": 4.6,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 40000 },
      { "name": "5 star", "count": 2350 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co/wZdkPjQH/download.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "description": "YouTube is the world’s largest video-sharing platform where millions of users upload, view, and share content daily. It allows creators to post vlogs, tutorials, gaming videos, documentaries, and more. Viewers can subscribe to channels, like, comment, and share videos effortlessly. The app offers personalized recommendations based on your watch history and interests. You can create playlists, stream live videos, and even download content for offline viewing with YouTube Premium. The platform also supports music streaming through YouTube Music and content monetization for creators. With its global reach, YouTube connects cultures, promotes education, and provides entertainment to billions. It’s not just a video app—it’s a community where ideas and creativity thrive.",
    "size": 44,
    "reviews": 31,
    "ratingAvg": 4.4,
    "downloads": 12,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 9000 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 2400 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co/jZ31cBkG/TikTok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "description": "TikTok is a short-form video platform that has revolutionized digital entertainment and creativity. It allows users to create, share, and explore videos ranging from comedy and dance to education and lifestyle. The app features a powerful algorithm that learns your preferences to serve personalized content on the 'For You' page. With editing tools, music overlays, and effects, anyone can become a creator in minutes. Challenges and trends keep the community active and connected. TikTok also supports live streaming, duets, and reactions for collaboration. Brands use it for marketing and engagement with a young, dynamic audience. It’s not just entertainment—it’s a cultural hub where creativity meets technology. Millions use TikTok every day to express themselves and connect globally.",
    "size": 94,
    "reviews": 45,
    "ratingAvg": 4.5,
    "downloads": 30,
    "ratings": [
      { "name": "1 star", "count": 70000 },
      { "name": "2 star", "count": 4000 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 9000 },
      { "name": "5 star", "count": 34100 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co/DH7YFTjQ/Google-Maps.jpg",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "description": "Google Maps helps millions navigate the world every day with accurate directions and location-based services. It offers real-time GPS navigation, traffic updates, public transport routes, and walking directions. You can explore nearby restaurants, shops, or landmarks with detailed reviews and photos. Street View provides 360° imagery of cities and places worldwide. Users can also save favorite locations and create custom maps. Google Maps supports offline downloads, making it reliable even without the internet. Businesses use it to list their locations and attract customers. Whether you’re traveling abroad or finding the fastest route home, Google Maps is your ultimate companion for smart navigation and local discovery.",
    "size": 50,
    "reviews": 300,
    "ratingAvg": 4.5,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 8000 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 23000 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co/VpPrbJHR/netflix.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "description": "Netflix is a global streaming service that offers an extensive collection of movies, TV shows, documentaries, and original content. It allows users to watch on-demand across multiple devices with personalized recommendations. Subscribers can create profiles, maintain watchlists, and receive notifications for new releases. Netflix supports offline downloads, high-definition streaming, and multiple language subtitles. It also provides parental controls, binge-watch features, and an intuitive interface for easy navigation. With exclusive originals like series, films, and specials, Netflix ensures there is something for everyone. The platform adapts recommendations based on viewing habits, and users can rate content for a better experience. Whether for entertainment, learning, or inspiration, Netflix has a diverse library accessible anywhere, anytime.",
    "size": 79,
    "reviews": 25,
    "ratingAvg": 4.6,
    "downloads": 14,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 70000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 1730 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co/RJdydn8/Spotify-Android.png",
    "title": "Spotify for Android",
    "companyName": "Spotify Ltd.",
    "description": "Spotify for Android brings all your favorite music and podcasts to your fingertips. It offers millions of tracks, curated playlists, and personalized recommendations to match your taste. Users can discover new releases, follow artists, and create custom playlists to enjoy anytime. The app supports offline listening, high-quality streaming, and seamless integration with smart devices. Podcasts cover news, education, lifestyle, and entertainment, all accessible from one platform. Spotify for Android allows sharing playlists with friends, collaborative playlists, and social interaction within the community. It also provides features like sleep timers, crossfade, and equalizer settings for a tailored experience. Whether commuting, working out, or relaxing, Spotify ensures your audio experience is personalized and uninterrupted.",
    "size": 24,
    "reviews": 150,
    "ratingAvg": 4.6,
    "downloads": 16,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 35000 },
      { "name": "5 star", "count": 1250 }
    ]
  },
  {
    "id": 9,
    "image": "https://i.ibb.co/PsJHP2qd/Microsoft-Office-Word-svg.png",
    "title": "Microsoft Word",
    "companyName": "Microsoft Corporation",
    "description": "Microsoft Word is a powerful document editor designed for creating, editing, and sharing documents from anywhere. It provides a wide range of templates, formatting tools, and design options to enhance your work. Users can collaborate in real-time, track changes, insert images, charts, tables, and hyperlinks. Word integrates seamlessly with cloud storage, allowing access across devices and easy sharing. Advanced features include spell check, grammar suggestions, voice dictation, and accessibility options. You can protect documents with passwords and permissions, ensuring security. With support for multiple file formats, offline editing, and printing capabilities, Microsoft Word is suitable for students, professionals, and organizations. The intuitive interface makes document management easy, efficient, and productive.",
    "size": 48,
    "reviews": 1200,
    "ratingAvg": 4.4,
    "downloads": 50,
    "ratings": [
      { "name": "1 star", "count": 5000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 30000 },
      { "name": "5 star", "count": 1020 }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co/5X4Sp3MP/Telegram.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "description": "Telegram is a cloud-based messaging platform that prioritizes speed, security, and ease of use. It allows users to send messages, photos, videos, and files of any type instantly. Groups, channels, and bots provide versatile options for communication, communities, and automation. Telegram supports voice and video calls, secret chats with end-to-end encryption, and self-destructing messages for privacy. Users can customize themes, notifications, and chat layouts for a personal experience. It works across multiple devices, including desktop and mobile, without compromising synchronization. Large file sharing, media compression, and fast search make communication smooth. Telegram continues to innovate with features like polls, quizzes, and animated stickers, making it more than just a messaging app—it's a complete communication ecosystem.",
    "size": 35,
    "reviews": 1400,
    "ratingAvg": 4.7,
    "downloads": 17,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 6000 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 10000 },
      { "name": "5 star", "count": 12000 }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co/81T11yg/Slack-icon-2019-svg.png",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "description": "Slack is a team communication and collaboration platform designed to streamline work. Users can create channels for specific projects, departments, or topics, and keep conversations organized. It supports file sharing, integrations with multiple services, and searchable chat history. Slack provides direct messaging, group messaging, and notifications to ensure teams stay aligned. With video and voice calls, screen sharing, and workflow automation, collaboration becomes seamless. Users can customize workspace appearance, set reminders, and connect apps like Google Drive, Trello, and Zoom. Slack enables transparency, efficiency, and faster decision-making. Security and compliance features protect sensitive information, making it suitable for organizations of all sizes. Overall, Slack simplifies team communication and boosts productivity across projects and departments.",
    "size": 62,
    "reviews": 800,
    "ratingAvg": 4.5,
    "downloads": 13,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 7600 }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co/QjdVs26S/zoom-meetings.webp",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "description": "Zoom is a reliable video communication platform that allows individuals and teams to connect virtually. It supports high-definition video and audio conferencing, webinars, chat messaging, and screen sharing. Zoom makes remote collaboration seamless with scheduling, recording, and breakout rooms. Participants can join from any device, including desktop, mobile, and tablets. Advanced features like virtual backgrounds, meeting transcription, and polling enhance engagement. The platform also supports security features such as encryption, waiting rooms, and passcodes. Users can integrate Zoom with calendar apps and productivity tools. Whether for work, education, or social interaction, Zoom provides an accessible, high-quality experience that simplifies online communication and connects people globally.",
    "size": 35,
    "reviews": 257,
    "ratingAvg": 4.4,
    "downloads": 23,
    "ratings": [
      { "name": "1 star", "count": 30770 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 5000 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 1750 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co/SD2YxTgn/Gmail-icon-svg.webp",
    "title": "Gmail",
    "companyName": "Google LLC",
    "description": "Gmail is a robust email service designed for efficient communication, organization, and productivity. Users can send and receive emails instantly, manage multiple accounts, and categorize messages using labels and filters. It provides powerful search functionality to find messages quickly. Gmail integrates with Google Workspace apps like Drive, Docs, and Calendar for seamless workflow. Security features include spam detection, phishing protection, two-factor authentication, and confidential mode. Users can schedule emails, create auto-responses, and organize inboxes with tabs. The mobile app allows easy access to emails on-the-go, supporting offline access and push notifications. Gmail ensures reliability, speed, and flexibility for personal, professional, and business communication, making it one of the most trusted email platforms worldwide.",
    "size": 21,
    "reviews": 3200,
    "ratingAvg": 4.5,
    "downloads": 27,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 9000 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 26000 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co/QFRrjTCq/Google-Drive-svg.png",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "description": "Google Drive is a cloud-based storage service that allows users to store, share, and access files securely from anywhere. It supports documents, spreadsheets, presentations, images, videos, and more. Users can organize files in folders, set permissions, and collaborate with team members in real time. Google Drive integrates with Google Workspace apps, allowing direct editing of Docs, Sheets, and Slides. Offline access, file version history, and advanced search make file management efficient and convenient. Drive also supports file backup, syncing across devices, and sharing links for external access. With robust security measures, including encryption and two-factor authentication, Google Drive ensures safety of your data. Whether for personal or professional use, Drive provides a reliable and flexible solution for digital storage and collaboration.",
    "size": 30,
    "reviews": 1800,
    "ratingAvg": 4.4,
    "downloads": 43,
    "ratings": [
      { "name": "1 star", "count": 3070 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 8070 },
      { "name": "4 star", "count": 1070 },
      { "name": "5 star", "count": 1100 }
    ]
  },
    {
    "id": 15,
    "image": "https://i.ibb.co/Gv8c9JNq/Microsoft-Office-Excel-svg.png",
    "title": "Microsoft Excel",
    "companyName": "Microsoft Corporation",
    "description": "Microsoft Excel is a versatile spreadsheet application that helps users organize, analyze, and visualize data efficiently. It supports formulas, functions, pivot tables, charts, and conditional formatting to gain insights from data. Excel allows collaboration in real-time with colleagues across devices and platforms. Users can automate tasks using macros and integrate with other Microsoft Office apps like Word and PowerPoint. Advanced tools include data validation, sorting, filtering, and scenario analysis. Excel is suitable for students, professionals, and businesses for budgeting, reporting, or complex data modeling. With cloud integration via OneDrive, your work is accessible anywhere. The intuitive interface, customizable ribbons, and templates make creating spreadsheets simple and productive. Excel empowers users to make data-driven decisions with confidence and precision.",
    "size": 59,
    "reviews": 1400,
    "ratingAvg": 4.3,
    "downloads": 26,
    "ratings": [
      { "name": "1 star", "count": 4000 },
      { "name": "2 star", "count": 2500 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 1000 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co/XxH2NtBP/Microsoft-Power-Point-svg.png",
    "title": "Microsoft PowerPoint",
    "companyName": "Microsoft Corporation",
    "description": "Microsoft PowerPoint is a dynamic presentation tool that enables users to create, edit, and share visually engaging slideshows. It offers templates, themes, animations, and transitions to make presentations impactful and professional. Users can insert multimedia elements like images, videos, charts, and audio clips to enhance storytelling. PowerPoint supports collaboration, allowing multiple users to edit slides simultaneously and provide comments. Presentations can be delivered live, recorded, or exported in various formats. Integration with cloud services ensures access across devices, while design ideas and AI suggestions improve slide layouts. With features like Presenter View, slide notes, and rehearsal tools, PowerPoint helps users deliver confident and polished presentations. It is ideal for business, education, and creative projects, making ideas come alive visually.",
    "size": 56,
    "reviews": 1100,
    "ratingAvg": 4.2,
    "downloads": 53,
    "ratings": [
      { "name": "1 star", "count": 3070 },
      { "name": "2 star", "count": 2000 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 9000 }
    ]
  },
  {
    "id": 17,
    "image": "https://i.ibb.co/d44B7X8t/Google-Photos-svg.png",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "description": "Google Photos is a comprehensive photo storage and sharing platform that organizes and protects your memories. It automatically backs up photos and videos to the cloud, providing unlimited storage options (within limits). Users can create albums, collages, animations, and movies from their media. Advanced AI-powered search and recognition allow you to find images easily by people, places, or objects. Editing tools include filters, cropping, color adjustments, and retouching. Google Photos also supports sharing with friends and family, as well as collaborative albums. You can free up device space while keeping media safe in the cloud. Features like live albums, suggestions, and timeline view enhance the experience. Whether for personal use, events, or professional photography, Google Photos keeps your memories organized, accessible, and enjoyable.",
    "size": 28,
    "reviews": 1600,
    "ratingAvg": 4.7,
    "downloads": 52,
    "ratings": [
      { "name": "1 star", "count": 10070 },
      { "name": "2 star", "count": 15000 },
      { "name": "3 star", "count": 4000 },
      { "name": "4 star", "count": 25000 },
      { "name": "5 star", "count": 9000 }
    ]
  },
  {
    "id": 18,
    "image": "https://i.ibb.co/Q3C6vH3s/gmail-go.jpg",
    "title": "Gmail Go",
    "companyName": "Google LLC",
    "description": "Gmail Go is a lightweight version of Gmail designed for low-end devices, offering essential email features with minimal data usage. Users can send and receive emails, manage inboxes, and organize messages efficiently. The app includes search functionality, spam protection, and simple navigation for quick access. Gmail Go supports multiple accounts, offline access, and push notifications. Its streamlined interface ensures faster performance while maintaining the reliability and security of Gmail. Users can archive, delete, or mark emails, and access attachments easily. Integration with Google services allows smooth workflow and collaboration. Whether for personal communication, work, or school, Gmail Go provides a reliable, fast, and user-friendly email experience on devices with limited resources.",
    "size": 22,
    "reviews": 723,
    "ratingAvg": 4.5,
    "downloads": 83,
    "ratings": [
      { "name": "1 star", "count": 1700 },
      { "name": "2 star", "count": 8000 },
      { "name": "3 star", "count": 2070 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 28000 }
    ]
  },
  {
    "id": 19,
    "image": "https://i.ibb.co/gbDJwpQd/Twitter-svg.png",
    "title": "Twitter",
    "companyName": "Twitter, Inc.",
    "description": "Twitter is a real-time social networking platform where users post and engage via short messages called tweets. It enables following accounts, trends, and hashtags to stay updated on news, sports, entertainment, and global events. Users can reply, retweet, like, and share content, making communication interactive. Twitter supports multimedia attachments, polls, and live streaming to enhance engagement. With lists, topics, and spaces, users can explore interests and communities easily. It provides analytics tools, verification features, and ad campaigns for businesses and creators. Privacy settings and security features protect accounts while maintaining accessibility. Twitter is widely used for information, networking, social interaction, and sharing opinions with a global audience.",
    "size": 35,
    "reviews": 987,
    "ratingAvg": 3.3,
    "downloads": 72,
    "ratings": [
      { "name": "1 star", "count": 40070 },
      { "name": "2 star", "count": 3000 },
      { "name": "3 star", "count": 7000 },
      { "name": "4 star", "count": 35000 },
      { "name": "5 star", "count": 155000 }
    ]
  },
  {
    "id": 20,
    "image": "https://i.ibb.co/ds05Qc4q/snapchat.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "description": "Snapchat is a multimedia messaging app that allows users to share ephemeral photos and videos called Snaps. It provides Stories, filters, AR effects, and chat features that disappear after being viewed. Users can create group chats, send Bitmojis, and engage with interactive content and games. Snapchat supports video and voice calls, Discover content, and live events to keep users informed and entertained. Memories let users save favorite Snaps and revisit them anytime. The platform encourages creativity with stickers, text, drawing tools, and lenses. Snapchat also integrates augmented reality experiences, enabling immersive storytelling. With privacy controls and notification settings, users can control their interactions and sharing. Snapchat delivers a fun, spontaneous, and visual messaging experience for friends and communities globally.",
    "size": 35,
    "reviews": 1800,
    "ratingAvg": 4.7,
    "downloads": 34,
    "ratings": [
      { "name": "1 star", "count": 3000 },
      { "name": "2 star", "count": 1700 },
      { "name": "3 star", "count": 6000 },
      { "name": "4 star", "count": 3070 },
      { "name": "5 star", "count": 10000 }
    ]
  }
]

